"""
装饰器：作用 就是 不改变原有函数的基础上，给原有函数增加额外功能
装饰器本质上就是一个闭包函数
装饰器的构成条件：
    有嵌套：函数嵌套
    有引用：内部函数使用外部函数的变量
    有返回：外部函数返回了内部函数名
    有额外功能：给需要装饰的原有函数增加额外功能

装饰器用法：
    格式1：传统写法
        装饰后的函数名 = 装饰器名(被装饰的原函数名)
        装饰后的函数名()
    格式2：语法糖: @装饰器 (最常见也最常用)
        在要被装饰的原函数上，直接写 @装饰器名，之后直接调用原函数即可
"""
# 例如，发表评论前，都是需要先登录的。
# 先定义有发表评论的功能函数，然后在不改变原有函数的基础上，需要提示用户要先登录。

# 1. 定义外部函数，形参列表接收 要被装饰的函数名(对象)
def check_login(fn_name): # fn_name:被装饰的函数名(对象)
    # 1.1. 定义内部函数，内部函数接收参数列表
    def inner():
        # 1.2. 额外功能-- 判断用户是否登录
        print('校验登录....登陆成功！')
        # 1.3 访问原函数
        fn_name()
    # 7. 返回内部函数名
    return inner

#2. 定义函数，表示 发表评论
def comment():
    print("发表评论")

@check_login
def payment():
    print("充值中...")


# 3. 测试
# 3.1 函数装饰器(传统方式)
# comment = check_login(comment)   # 弊端，原函数被覆盖，不能再次访问，若有需求，赋值给新的变量
# comment()
# ct = check_login(comment)
# ct()
# comment()

# 3.2 语法糖
payment()