"""
装饰器的使用分类：
    细节：
        装饰器的内部函数格式，要和 被装饰的原函数 保持一致，
        即：原函数是无参无返回的， 则 装饰器的内部函数也必须是 无参无返回值的
            原函数时有参有返回的，则 装饰器的内部函数也必须是 有伞又返回的

1.无参无返回值的函数
2.有参无返回值的函数
3.无参有返回值的函数
4.有参有返回值的函数

"""

# 需求：定义有参无返回值的 get_sum() 求和函数，在不改变其代码的基础上，添加友好提示：正在努力计算中...
# 1. 定义装饰器
def my_decorator(func):
    #1.1 定义内部函数
    def fun_inner(*args):
        # 1.2 添加提示信息【额外功能】
        print("正在努力计算中...")
        # 1.3 调用原函数【原功能】
        func(*args)
    # 1.4 返回内部函数
    return fun_inner

# 2. 定义被装饰的函数
@my_decorator
def get_sum(a, b):
    total = a + b
    print(f"sum 求和结果： {total}")

# 3.测试
# 3.1 传统方式
# get_sum = my_decorator(get_sum)
# get_sum(1, 2)

# 3.2 语法糖
get_sum(10, 30)