"""
装饰器的使用分类：
    细节：
        装饰器的内部函数格式，要和 被装饰的原函数 保持一致，
        即：原函数是无参无返回的， 则 装饰器的内部函数也必须是 无参无返回值的
            原函数时有参有返回的，则 装饰器的内部函数也必须是 有伞又返回的

1.无参无返回值的函数
2.有参无返回值的函数
3.无参有返回值的函数
4.有参有返回值的函数

多个装饰器装饰一个函数：
    多个装饰器装饰1个原函数，是按照 由内向外 的顺序来装饰的，
    但如果你要是用 装饰的写法来做，看到的效果是：从上往下执行的
    离函数最近的装饰器先装饰，然后外面的装饰器在进行装饰，是 由内到外 的装饰过程

带有参数的装饰器：
 1. 1个装饰器的参数有且只能有1个
 2. 如果装饰器有多个参数，可以在该装饰器的外边再包裹一层，把该装饰器当做其 内部函数 返回即可
"""

# 需求：定义一个既能装饰减法、又能装饰加法的装饰器 --> 即 带参数的装饰器
# 1. 定义装饰器
# fn_name:原函数，flg: 标记    报错，装饰器的参数只能有1个

def my_decorator(fn_name):
    #1.1 定义内部函数
    def fun_inner(a, b):
        # 1.2 添加提示信息【额外功能】
        if fn_name.__name__ == 'get_sum':
            print("正在努力计算【加法】中...")
        elif fn_name.__name__ == 'get_sub':
            print("正在努力计算【减法】中...")
        # 1.3 调用原函数【原功能】
        return fn_name(a, b)

    # 1.4 返回内部函数
    return fun_inner


# 2. 定义原函数，表示加法运算
@my_decorator
def get_sum(a, b):
    return a + b

# 3. 定义原函数，表示减法运算
@my_decorator
def get_sub (a, b):
    return a - b

# 4.测试
print(get_sum(10, 20))
print("-" * 23 )
print(get_sub(50, 10))
print("-" * 23 )


