"""
# 正则表达式（Regular Expression）是一种由特定语法规则组成的文本模式，用来描述、匹配字符串中符合特定规则的字符序列。
# 就相当于一种模式匹配工具，允许用户通过简洁的语法进行复杂文本的搜索、匹配、提取和替换工作。
# python 提供的正则标准库 ---re
# import re
# result = re.match(r"1[3-9]\d{9}", s)  #match -- 从字符串的开头开始匹配(返回Match对象)
# result = re.search(r"1[3-9]\d{9}", s) #search -- 从任意位置开始，搜索第一个匹配项(返回Match对象)
# result = re.findall(r"1[3-9]\d{9}", s) #findall -- 从任意位置开始，搜索所有匹配项(返回list)

#正则表达式语法：
表达式        描述
普通字符     字母、数组、汉字、以及大多数字符，直接匹配自身
.          匹配任意一个字符（除\n）
\d         匹配数字 0-9
\D         匹配非数字
\w         匹配单词字符，即 a-z、A-Z、0-9、_、其他语言字符
\W         匹配非单词字符
[aeiou]    匹配其中的任意单个字符
[^aeiou]   求反，匹配不在字符列表中的任意单个字符
[0-5]      表示范围
*          出现任意次数(0次货无数次) 1[3-9]\d*
+          至少出现1次(1次货无数次)  1[3-9]\d+
？         至多出现一次(0次或1次)    1[3-9]\d?
{m}        出现m次                 1[3-9]\d{9}
{m,}       至少出现m次              1[3-9]\d{9,}
{m,n}      出现 m到n次              1[3-9]\d{9, 11}
|          或的意思，匹配左右任意一个表达式  1(3|5|7|8|9)\d{9}
()         分组，将括号里的多个字符视为一个单元 (ab)+
^          匹配字符串开头   ^1[3-9]\d{9}$
$          匹配字符串结尾  ^1[3-9]\d{9}$
"""

import re
s1 = "18809090000是我的手机号，你记住了吗？我的另一个手机号是18800008888，两个QQ号分别是155998992 和 18809091293821 你记住了吗？"
s2 = "我的手机号是18809090000，你记住了吗？我的另一个手机号是18800008888，两个QQ号分别是155998992 和 18809091293821 你记住了吗？"

# match
# result = re.match(r"1[3-9]\d{9}", s1)
# print(result.group()) # 获取到匹配的结果
# print(result.span()) # 获取匹配项的索引
# print(result.start()) # 获取匹配项的开始索引
# print(result.end()) #获取匹配项的结束索引
print("-------------------------------------")
# search
# result = re.search(r"1[3-9]\d{9}", s2)
# print(result.group()) # 获取到匹配的结果
# print(result.span()) # 获取匹配项的索引
# print(result.start()) # 获取匹配项的开始索引
# print(result.end()) #获取匹配项的结束索引

print("------------------------------------")
# findall
result = re.findall(r"1[3-9]\d{9}", s2)
print(result) # 获取到匹配的结果
