"""

#正则表达式语法：
表达式        描述
普通字符     字母、数组、汉字、以及大多数字符，直接匹配自身
.          匹配任意一个字符（除\n）
\d         匹配数字 0-9
\D         匹配非数字
\w         匹配单词字符，即 a-z、A-Z、0-9、_、其他语言字符
\W         匹配非单词字符
[aeiou]    匹配其中的任意单个字符
[^aeiou]   求反，匹配不在字符列表中的任意单个字符
[0-5]      表示范围
*          出现任意次数(0次货无数次) 1[3-9]\d*
+          至少出现1次(1次货无数次)  1[3-9]\d+
？         至多出现一次(0次或1次)    1[3-9]\d?
{m}        出现m次                 1[3-9]\d{9}
{m,}       至少出现m次              1[3-9]\d{9,}
{m,n}      出现 m到n次              1[3-9]\d{9, 11}
|          或的意思，匹配左右任意一个表达式  1(3|5|7|8|9)\d{9}
()         分组，将括号里的多个字符视为一个单元 (ab)+
^          匹配字符串开头   ^1[3-9]\d{9}$
$          匹配字符串结尾  ^1[3-9]\d{9}$
"""

import re
s1 = "18809090000是我的手机号，188开头的，以00结尾的；我的另一个手机号是15500008888，两个QQ号分别是1259989092 和 13809091293821，邮箱为python66@163.com,"

# 正则表达式
# print(re.findall(r"188.*", s1))
# print(re.findall(r"188.?", s1))
# print(re.findall(r"188.+", s1))
# print("===================================")

# print(re.findall(r"188\d{8}", s1))
# print(re.findall(r"155\d{6,10}", s1))
# print(re.findall(r"155\d{6,}", s1))

# print(re.findall(r"1[38]\d{8}", s1))
# print(re.findall(r"1[^38]\d{8}", s1))
# print(re.findall(r"1[3-9]\d{8}", s1))
# print(re.findall(r"^1[3-9]\d{9}", s1))
# print(re.findall(r"^1[3-9]\d{9}$", s1))

print(re.findall(r"\w+@\w+\.\w+", s1)) #\w 匹配任何单词字符（a-z、A-Z、0-9、_、其他字符） --- 默认行为
print(re.findall(r"\w+@\w+\.\w+", s1, re.ASCII)) #\w 匹配任何单词字符（a-z、A-Z、0-9、_）

s2 = "现在的时间是2026-02-06 10：05：25，今天的天气还可以，气温是28度"
print(re.findall(r"\d{4}-\d{2}-\d{2}", s2))
print(re.findall(r"(\d{4})-(\d{2})-(\d{2})", s2))