"""
网编： 用来实现 不同计算机上 运行的程序间 进行数据交互  ----》socket
    三要素：
        IP地址： 网络中设备的唯一标识，
                查看：ipconfig(windows),ifconfig(linux,mac) ,
                测试网络连接：ping ip地址/域名
        端口：程序在设备(电脑，手机，ipad...)上的唯一标识
            范围：0-65535，其中0~1023已经被系统占用或者用作保留接口自定义端口时尽量规避这个范围
        协议: 传输规则、规范
            常用协议：TCP(用的最多)和UDP
            TCP特点：1.面向有连接，2.采用字节流传输数据，理论无大小限制，
                    3.安全(可靠)协议，4.效率相对较低，5.区分客户端和服务器端
进程，线程 都是程序（CPU）实现多任务的手段
进程 = CPU分配资源的最小单位   ---》 processing
线程 = CPU调度资源的基本单位   ---》threading

进程间数据隔离，线程间数据共享

socket套接字
socket（简称 套接字）是进程之间通信的一个工具，进程之间想要进行网络通信需要基于这个socket
"""

