"""
排序：使一串记录，按照其中的 某个或某些关键字 的大小递增递减
排序算法：使记录递增递减的 方法
稳定性算法：具有相同官架子的记录经过排序后，相对位置保持不变，这样的算法是稳定性算法。
排序算法的稳定性：相同元素 的 相对位置 是否发生改变，未改变就是稳定。
稳定的排序算法：
    冒泡排序、插入排序、归并排序、基数排序
不稳定的排序算法：
    选择排序、快速排序、希尔排序、堆排序


冒泡排序：重复地走访过要排序的元素列，依次比较两个相邻的元素，如果顺序错误就把他们交换过来。
    相邻元素两两比较，大的往后走，这样第一轮比较完毕后，最大值就在最大索引处，重复此动作，直至排序完成。
    要素：
        1.比较的总轮数：列表长度-1
        2.每轮比较的总次数： 列表长度 -1 - 轮数(索引，从0开始)
        3.谁和谁比较： j 和 j+1 位置的元素  a,b = b,a
时间复杂度：
    最优: O(n)
    最坏: O(n²)

扩展：冒泡排序 = 稳定 排序算法
扩展：
    外循环的 -1 是什么意思：减少比较轮数，提高效率
    内循环的 -1 是什么意思：为了防止索引 越界
    内循环的 -i 是什么意思：减少每轮比较的次数，提高效率
"""

def bubble_sort(alist): # 形参接收可变类型，则：形参的改变直接影响实参
    """
    冒泡排序
    :param alist:
    :return:
    """
    # 获取列表长度
    n = len(alist)
    # 外层循环控制轮数
    for i in range(n-1):
        count = 0
        # 内层循环控制比较次数
        for j in range(n-1-i):
            # 比较
            if alist[j] > alist[j+1]:
                # 细节2：发生了交换
                count += 1
                # 交换 a,b = b,a
                alist[j], alist[j+1] = alist[j+1], alist[j]
        # 细节3
        print(f'第{i + 1}轮 交换了 {count}次')
        # 细节4：判断如果本轮没有发生交互，说明已经排完序的，结束即可
        if count == 0:
            break

    return alist

if __name__ == '__main__':
    my_list = [5, 3, 6, 7, 2]
    # my_list = [2, 3, 5, 6, 7]
    my_list = [3, 2, 5, 7, 6]
    print(bubble_sort(my_list))  # 实参，可变