"""
插入排序：
 将一个数据插入已经排好序的有序数据中，从而得到一个新的、个数加一的有序数据，算法适用于少量数据的排序。
 插入排序的组成：
    第一部分：有序的数字
    第二部分：无序的数字
插入算法的基本思想：
    有2个序列，有序序列和无序序列，将无序序列中的每一个元素插入到有序序列中。

    流程：假设共5个元素
        第几轮(索引)    公式(具体的谁和谁比较)                         该轮比较的总次数
        第1轮(索引：0)， 索引1和 0比较                                      1次
        第2轮(索引：1)， 索引2和1，2 和0 比较,                               2次
        第3轮(索引：2)， 索引3和2，3和1，3 和0比较,                           3次
        第4轮(索引：3)， 索引4和3，4和2，4，和1，4和0比较,                     4次

    要点：
        1.比较的总轮数：列表长度-1   range(1, n)
        2.每轮比较的总次数： range(i, 0, -1)
        3.谁和谁比较(交换)： 索引j 和 j-1 位置的元素比较

时间复杂度：
    最优:O(n)
    最坏: O(n²)
扩展：插入排序 = 稳定 排序算法
扩展：

"""

def insert_sort(alist):
    """
    插入排序
    :param alist:
    :return:
    """
    # 获取列表长度
    n = len(alist)
    # 外层循环控制轮数
    for i in range(1, n):
        # 内层循环控制比较次数
        for j in range(i, 0, -1):
            # 获取比较元素
            if alist[j] < alist[j-1]:
                alist[j], alist[j-1] = alist[j-1], alist[j]
            else:
                break

if __name__ == '__main__':
    my_list = [5, 3, 6, 7, 2]
    insert_sort(my_list)
    print(my_list)