"""
树(tree)是一种 非线性结构(N个前驱，N个后继)
树的术语：
    节点的度：一个节点含有的子节点的个数称为该节点的度
    树的度：一棵树中，最大的节点的度称为树的度
    父亲节点或父节点：若一个节点含有子节点，则这个节点称为其子节点的父节点
    还在节点或子节点：一个节点含有的子树的根节点称为该节点的子节点
    兄弟节点：具有相同父节点的节点互称为兄弟节点
    节点的层次:从根开始定义起，根为第1层，根的子节点为第2层，以此类推
    树的高度或深度：树中节点的最大层次
    堂兄弟节点：父节点在同一层接的节点互称为堂兄弟
    节点的祖先：从根到该节点所经分支上的所有节点
    子孙：以某个节点为根的子树中任一节点都称为该节点的子孙
    森林：由m(m>=0)棵互不相交的树的集合称为森林

树的特点：
    1.每个节点都有零个多个子节点
    2.没有父节点的节点称为根节点
    3.每个非根节点有且只有一个父节点
    4.除了根节点外，每个子节点可以分为多个不相交的子树

树的种类：
无序树：树中任意节点的子节点之间没有顺序关系
有序树：树中任意节点的子节点之间有顺序关系
二叉树：每个节点最多含有两个子树的树称为二叉树
    完全二叉树：最后一层不满，其他都是满的
    满二叉树：都是满的
    非完全二叉树：中间有断的
    平衡二叉树：任意节点的两个子树的高度差不超过1
我们用的最多的就是：二叉树
存储：
    顺序存储：既要存储数据，又要存储节点的关系
    链式存储：采用节点(item,lchild, rchild)的方式，形成链表来存储


了解：
    霍夫曼树(用于信息编码)：带权路径最短的二叉树称为哈夫曼树或最优二叉树
    B树：一种对读写操作进行优化的自平衡的二叉查找树，能够保持数据有序，拥有多于两个的子树

广度优先：一层一层
深度优先：
    前序：根左右
    中序：左根右
    后序：左右根
"""