"""
数据容器：
列表(list), l=[1, 2, 4, 8]---> 可以存储不同类型的元素(项目中一般存储同一类型的)，元素有序、可以重复、元素可以修改
字符串(str),
元祖(tuple),
集合(set),
字典(dict)

特性		  字符串(str)		列表(list)		元祖(tuple)		集合(set)		字典(dict)
有序性		有序		         有序		      有序		      无序		     有序(3.7+)
重复元素		允许		         允许		      允许		      不允许		     key不允许
可变性		不可变		     可变		      不可变		      可变		     可变
索引访问		支持		         支持		      支持		      不支持		     不支持
切片操作		支持		         支持		      支持		      不支持		     不支持
使用场景		文本处理		有序可重复数据集合		固定数据记录	      去重数据集合	 键值对



列表(list)总结：
定义：l = [56, 90, 88, 65, 90, 'A', 'Hello', True]
访问列表元素：-- 正向索引 从0开始，反向索引从-1开始  print(l[0], l[-8])
# 修改  l[5] = 'a'  # 如果指定的索引超出范围， 将会报错。IndexError: list assignment index out of range
# 删除  del l[6]
# 遍历
for item in l:
    print(item, end=' ')
    
# 列表-切片  序列数据[开始索引:结束索引:步长]
# 包含开始索引，不包含结束索引，开始索引不指定默认从0开始，结束索引不指定默认列表长度，步长未指定默认为1
print(l[0:5:2])
print(l[:5])
print(l[0:-2])

列表常见方法：
append() 在列表尾部追加元素 l.append(10086)
insert() 在指定索引之前，插入该元素 l.insert(0, 92)
remove() 移除列表中第一个匹配到的值 l.remove(92)
pop([索引]) 删除列表中指定索引位置的元素(如果未指定索引，默认删除最后一个) l.pop(2) / l.pop()
sort() 对列表进行排序(列表元素的数据类型一致，才可以进行排序),默认从小到大   l.sort()
reverse()  反转列表元素  l.reverse()
---------------------------------------------------------------------------
sum(l) 函数-用于求和, len(l)函数-用于获取列表长度
in: 检查元素是否在列表中, 元素 in 列表 -- 存在返回True， 取反: not in
解包：将列表这一类容器解开成一个一个独立的元素， 语法： *列表
组包: 将多个元素合并到一个容器
合并列表方式：1.循环添加（不推荐）2. 使用 + 运算符直接合并 3. 使用* 进行解包操作

列表推导式---> 就是按照一定的规则快速生成一个列表的方法
语法格式:列表名 = [要插入的值/表达式 for i in 序列/列表]
        列表名 = [要插入的值/表达式 for i in 序列/列表 if 条件]

"""

"""
# 列表操作
#定义
l = [56, 90, 88, 65, 90, 'A', 'Hello', True]
print(type(l))
print(isinstance(l, list))

# 访问列表元素
# 获取 -- 正向索引 从0开始，反向索引从-1开始
print(l[0], l[-8])
print(l[2], l[-6])

# 修改
l[5] = 'a'
print(l[5])
# 如果指定的索引超出范围， 将会报错。IndexError: list assignment index out of range
# l[10] = 'DEF'
# print(l[10])

# 删除
del l[6]
print(l)

# 遍历
for item in l:
    print(item, end=' ')

print()
# 列表-切片  序列数据[开始索引:结束索引:步长]
# 包含开始索引，不包含结束索引，开始索引不指定默认从0开始，结束索引不指定默认列表长度，步长未指定默认为1
print(l[0:5:2])
print(l[:5])
print(l[0:-2])
"""

"""
print('----------------------------------')
s = [56, 90, 88, 65, 90, 100, 209, 32, 167]
#追加
s.append(188)
print(s)
# 插入 在指定索引之前，插入该元素
s.insert(1, 18)
print(s)
# 移除
s.remove(88)
print(s)

# 删除列表中指定索引位置的元素(如果未指定索引，默认删除最后一个)
s.pop(1)
s.pop()
print(s)

# 对列表进行排序(列表元素的数据类型一致，才可以进行排序),默认从小到大
s.sort()
print(s)
# 反转列表元素 
s.reverse()
print(s)
"""

"""
#案例： 将用户输入的10个数字，存储到一个列表中，并将列表中的数字进行排序，输出其中的最小值、最大值 和平均值

# 1.定义列表
num_list = []
# 2. 将用户输入的10个数字存入列表
for i in range(10):
    num = int(input("请输入一个数字："))
    num_list.append(num)
print("数字列表：",num_list)
# 3.操作-排序
num_list.sort()
print("排序后：",num_list)
# 4. 输出其中的最小值、最大值、和平均值
# ***sum 函数-用于求和, len()函数-用于获取列表长度
print(f"最小值：{num_list[0]}, 最大值：{ num_list[-1]}, 平均值：{sum(num_list) / len(num_list)}")
"""

"""
# 案例 合并两个列表中的元素，并对合并的结果进行去重处理
***in: 检查元素是否在列表中, 元素 in 列表 -- 存在返回True， 取反: not in
***解包：将列表这一类容器解开成一个一个独立的元素， 语法： *列表
组包: 将多个元素合并到一个容器
合并列表方式：1.循环添加（不推荐）2. 使用 + 运算符直接合并 3. 使用* 进行解包操作
"""
"""
num_list1 = [19, 23, 54, 64, 875, 20, 109, 232, 123, 54]
num_list2 = [55, 80, 72, 35, 60, 123, 54, 29, 91]
# 1.合并列表-方式1 循环添加
# for num in num_list2:
#     num_list1.append(num)
# print(f"合并后的列表：{num_list1}")

# 1.合并列表-方式2 使用解包
# num_list = [*num_list1, *num_list2]

# 1.合并列表-方式3
num_list = num_list1 + num_list2
print(f"合并后的列表：{num_list}")

# 去重 in-元素是否存在列表中，存在返回True， 反之返回False
new_list = [] # 去重后的新列表
for num in num_list:
    # 判断是否存在
    if  num not in new_list:
        new_list.append(num)

print(f"去重后的列表：{new_list}")
"""

"""
需求：
1. 生成1-20的平方列表
2. 从如下数字列表中提取所有偶数，并计算其平方，组成一个新的列表
num_list = [19, 23, 54, 64, 87, 20, 109, 232, 123, 43, 26, 55, 72]
"""
# 1. 生成1-20的平方列表

#  方式1：传统方式
# s_list = []
# for i in range(1, 21):
#     s_list.append(i**2)

# 方式2： ***列表推导式---> 就是按照一定的规则快速生成一个列表的方法 -->
# 语法格式:列表名 = [要插入的值/表达式 for i in 序列/列表]  /  列表名 = [要插入的值/表达式 for i in 序列/列表 if 条件]
s_list = [i**2 for i in range(1, 21)]
print(f"1-20的平方列表:{s_list}")

# 提取所有偶数，并计算其平方，组成一个新的列表
num_list = [19, 23, 54, 64, 87, 20, 109, 232, 123, 43, 26, 55, 72]
# new_list = []
# for num in num_list:
#     if num % 2 == 0:
#         new_list.append(num**2)

new_list = [i**2 for i in num_list if num % 2 == 0]
print(f"偶数的平方列表：{new_list}")