"""
PyPI:全称 Python Package Index, 是由Python官方和社区共同维护的Python第三方软件包的官方仓库。
https://pypi.org/
pip：是Python官方提供的python包的管理工具， 提供了对python包的查找、下载、安装、卸载等功能。
AI大模型知识：
提示词(Prompt)：是引导大模型(LLM)进行内容生成的命令(一句话、一个问题等) 引导AI思考，约束其输出范围，并明确你期望的结果。
提示词工程(Prompt Engineering):通过有技巧的编写提示词，使用大模型生成尽可能符合预期的内容，这一持续性的过程就称为提示词工程。
1.给大模型设定角色与能力(你是一名经验丰富的高中历史老师，擅长生动有趣的讲解复杂历史事件)
2.明确核心请求与任务(请向以为高中生解释法国大革命爆发的主要原因)
3.按步骤拆解复杂任务(请先概述背景，然后分政治、经济、思想三个方面阐述，每点配一个例子)
4.指定风格与语气(请使用简洁、口语化、充满热情的语气(避免使用过于学术的术语))
5.明确需求输出格式(请严格按照如下结构输出：....)
6.提供输入输出的示例(可以参考<<人类群星闪耀时>>的叙事风格。请不要列出冗长的日期列表)

例子：
你是一名经验丰富的高中历史老师，擅长生动有趣的讲解复杂历史事件。现在请完成以下任务：
1.核心任务：请向以为高中生解释法国大革命爆发的主要原因。
2.表达要求：
   语气风格： 使用简洁、口语化、充满课堂热情的语气，避免学术黑话。整体叙事可以借鉴<<人类群星闪耀时>>中对历史关键时刻的描写手法，富有画面感和戏剧性。
   内容禁忌： 聚焦于原因分析，不要罗列冗长的日期和时间过程表
3.内容与结构要求：
    开头：先用一段话，生动描述革命前发过社会的总体分为和紧张感（即鳖精概述）。
    主体：分别从政治、经济、思想三个层面阐述直接原因。每个层面提炼2个关键点，并为每个关键点配一个具体、有说服力的史实例子。
    结尾：提供一个帮助学生记忆的妙招。
4.输出格式：请严格、完整地按照以下框架组织你的回答：
【历史现场氛围】
（在这里写你的背景概述）
【危机根源解析】
政治层面：
- 关键点1 ：…… 例子：……
- 关键点2：…… 例子：……
经济层面：
- 关键点1 ：…… 例子：……
- 关键点2：…… 例子：……
思想层面：
- 关键点1 ：…… 例子：……
- 关键点2：…… 例子：……
【记忆法宝】
（提供一个巧妙的比喻，口诀或联想图像，将这三大层面串联起来，方便学生瞬间记忆）

"""


# Please install OpenAI SDK first: `pip3 install openai`

import os
from openai import OpenAI

# 创建与AI大模型交互的客户端对象(DEEPSEEK_API_KEY 环境变量的名字，值就是DeepSeek的API_KEY的值)
client = OpenAI(
    api_key=os.environ.get('DEEPSEEK_API_KEY'),
    base_url="https://api.deepseek.com")

# 与AI大模型进行交互(参数)
response = client.chat.completions.create(
    model="deepseek-v4-pro",
    messages=[
        {"role": "system", "content": "你是一名非常可爱的AI助理，你的名字叫小甜甜，请你使用温柔可爱的语气回答用户的问题"},
        {"role": "user", "content": "你是谁，能帮我做什么？"},
    ],
    stream=False,
    # reasoning_effort="high",
    # extra_body={"thinking": {"type": "enabled"}}
)

# 输入大模型返回的结果
print(response.choices[0].message.content)